package ru.voenmeh.openday.domain.constants

object Constants {

    object Numbers {
        const val numbersOfFaculty = 7
    }

    object Strings {
        val faculty: String = "Факультет"
        val facultyA: String = "Факультет “А”"
        val descriptionA: String = "Ракетно-космической техники (ранее авиа- и ракетостроения), один из старейших в стране, существует 70 лет. За это время подготовлено более 15 тысяч высококвалифицированных специалистов в области ракетной техники. Подготовку инженеров, бакалавров и магистров осуществляют семь выпускающих кафедр и одна обеспечивающая."
        val urlImageA: String = "https://www.voenmeh.ru/images/faculties-and-departments/A/A1/a1-1.jpg"
        val specializationA: List<String> = listOf(
            "Кафедра А1 «Ракетостроение»",
                    "Кафедра А2 «Технология конструкционных материалов и производства ракетно-космической техники»",
        "Кафедра А3 «Космические аппараты и двигатели»",
        "Кафедра А4 «Стартовые и технические комплексы ракет и космических аппаратов»",
        "Кафедра А5 «Динамика и управление полетом летательных аппаратов»",
        "Кафедра А8 «Двигатели и энергоустановки летательных аппаратов»",
        "Кафедра А9 «Плазмогазодинамика и теплотехника»"
        )
        val linkA: String = "https://www.voenmeh.ru/education/faculties-and-departments/faca"
        val facultyE: String = "Факультет “Е”"
        val descriptionE: String = "Оружие и системы вооружения создан на базе кафедр, являющихся родоначальниками Военно-механического института. Это ведущий факультет в области подготовки высококвалифицированных специалистов по промышленным, военно-механическим и оборонным направлениям. Это идеальное место для людей, которые мыслят глобально, открыты для новых знаний, и для которых обучение — это шаг к достижению поставленных целей. Факультет «Оружие и системы вооружения» в настоящее время является единственным в российской системе образования факультетом, на котором сосредоточены все без исключения специальности государственного образовательного стандарта ВПО «Оружие и системы вооружений». Таким образом, факультет «Е» является единственным в своем роде оборонно-техническим факультетом, реализующим гособоронзаказ."
        val urlImageE: String = "https://www.voenmeh.ru/images/faculties-and-departments/E/E1/kaf_e1_3.jpg"
        val specializationE: List<String> = listOf(
            "Кафедра Е1 «Стрелково-пушечное, артиллерийское и ракетное оружие»",
            "Кафедра Е2 «Технология и производство артиллерийского вооружения»",
            "Кафедра Е3 «Средства поражения и боеприпасы»",
            "Кафедра Е4 «Высокоэнергетические устройства автоматических систем»",
            "Кафедра Е5 «Экология и производственная безопасность»",
            "Кафедра Е6 «Автономные информационные и управляющие системы»",
            "Кафедра Е7 «Механика деформируемого твердого тела»"
        )
        val linkE: String = "https://www.voenmeh.ru/education/faculties-and-departments/face"
        val facultyI: String = "Факультет “И”"
        val descriptionI: String = "Ни для кого не секрет, что на сегодняшний день информационные технологии, интеллектуальные системы, современная радиоэлектроника, лазерные системы, робототехнические комплексы и многое другое, что принято относить к высоким технологиям, не только обеспечивают конкурентоспособность выпускаемой продукции, но и во многом определяют вектор развития общества, способствуют его техническому прогрессу. Именно таким технологиям вы сможете посвятить себя, поступив на факультет «И» Информационные и управляющие системы."
        val urlImageI: String = "https://www.voenmeh.ru/images/faculties-and-departments/I/I1/kaf_i1_4.jpg"
        val specializationI: List<String> = listOf(
            "Кафедра И1 «Лазерная техника»",
            "Кафедра И4 «Радиоэлектронные системы управления»",
            "Кафедра И8 «Системы приводов, мехатроника и робототехника»",
            "Кафедра И9 «Систем управления и компьютерных технологий»",
        )
        val linkI: String = "https://www.voenmeh.ru/education/faculties-and-departments/faci"
        val facultyO: String = "Факультет “О”"
        val descriptionO: String = "Факультет «О» Естественнонаучный - самый молодой факультет нашего университета, однако в его состав вошли кафедры с многолетней историей и замечательными традициями. Сегодня в составе факультета две выпускающие кафедры и четыре общеобразовательных."
        val urlImageO: String = "https://www.voenmeh.ru/images/faculties-and-departments/I/I2/kaf-I2_1.jpg"
        val specializationO: List<String> = listOf(
            "Кафедра О2 «Инжиниринг и менеджмент качества»",
                    "Кафедра О3 «Инженерная и машинная геометрия и графика»",
                    "Кафедра О4 «Физика»",
                    "Кафедра О5 «Физическое воспитание и спорт»",
                    "Кафедра О6 «Высшая математика»",
                    "Кафедра О7 «Информационные системы и программная инженерия»",
                    "Кафедра О8 «Электротехника»"
        )
        val linkO: String = "https://www.voenmeh.ru/education/faculties-and-departments/faco"
        val facultyR: String = "Факультет “Р”"
        val descriptionR: String = "Обучающиеся на факультете проходят практику и в дальнейшем трудоустраиваются на ведущих промышленных предприятиях Санкт-Петербурга. Выпускники факультета работают на предприятиях и в организациях различного профиля, осуществляющих свою деятельность в сфере промышленного производства («Арсенал», «Кировский завод», «Силовые машины», «Рубин», «КБСМ» и др.), государственного и муниципального управления, в учреждениях высшего образования, академических и научно-исследовательских организациях, в сфере международной коммуникации, технического и специального перевода, интеллектуальной обработки баз данных, связей с общественностью. Специалисты востребованы в учреждениях среднего общего и среднего, а так. же высшего образования, в органах государственной власти и управления Российской Федерации, в консалтинговых компаниях. Обучение на факультете «Международного промышленного менеджмента и коммуникации» в БГТУ «ВОЕНМЕХ» им. Д. Ф. Устинова — гарантия вашей успешной карьеры в будущем!"
        val urlImageR: String = "https://www.voenmeh.ru//images/bagallery/original/kaf-r7_1.jpg"
        val specializationR: List<String> = listOf(
            "Кафедра Р1 «Менеджмент организации»",
            "Кафедра Р4 «Экономика, организация и управление производством»",
            "Кафедра Р7 «Теоретической и прикладной лингвистики»",
            "Кафедра Р10 «Философия»",
            "Отдел образовательных программ MBA",)
        val linkR: String = "https://www.voenmeh.ru/education/faculties-and-departments/facr"
        val facultyVUC: String = "Военный учебный центр"
        val descriptionVUC: String = "Факультет среднего профессионального образования был образован в 2023 году. Чем преимущества обучения на программах среднего профессионального образования:\nПрофессиональный цикл дисциплин ведут высококвалифицированные преподаватели – представители промышленных предприятий, профильных кафедр БГТУ «ВОЕНМЕХ» им. Д.Ф. Устинова;\nВостребованность на рынке труда, в том числе на предприятиях оборонно-промышленного комплекса; престижность специальностей.\nПри поступлении на факультет проводится конкурс аттестатов, т.е. без результатов ЕГЭ. После окончания обучения можно продолжить образование и поступить в БГТУ «ВОЕНМЕХ» им. Д.Ф. Устинова на родственную  специальность также без ЕГЭ,  а по результатам внутренних испытаний.\nПредприятия – потенциальные работодатели выпускников факультета среднего профессионального образования: АО \"НПП \"Радар ммс\", АО «НИИ командных приборов», ООО «Специальный Технологический Центр», АО «Петербургский тракторный завод», АО «Обуховский завод»."
        val urlImageVUC: String = "https://www.voenmeh.ru/cache/images/vuc/pantyuhin_500x333-equal.jpg"
        val specializationVUC: List<String> = listOf("Программа подготовки офицеров запаса и матросов запаса предусматривает обучение граждан, успешно прошедших конкурсный отбор, военно-учетным специальностям с последующим присвоением воинского звания, соответствующего программе подготовки, и зачисления в запас в случае успешного освоения программы высшего образования и программы военной подготовки. Срок обучения офицеров запаса составляет 2,5 года, матросов запаса – 1,5 года.")
        val linkVUC: String = "https://www.voenmeh.ru/education/vuc"
        val facultySPO: String = "Факультет “СПО”"
        val descriptionSPO: String = "Балтийский государственный технический университет «ВОЕНМЕХ» им. Д.Ф. Устинова является уникальным ВУЗом, который тесно связан с оборонным комплексом нашей страны. Уже более 85 лет в стенах университета организована военная подготовка, в ходе которой обучающиеся изучают военные дисциплины в ходе аудиторных занятий, а также применяют и закрепляют свои знания и умения на практике во время проведения учебных сборов и стажировок в воинских частях и на крупнейших предприятиях оборонно-промышленного комплекса нашей страны. В военном учебном центре реализуются как программы подготовки кадровых военных, так и программы подготовки офицеров запаса и матросов запаса. Программа подготовки офицеров кадра рассчитана на юношей, решивших связать свою жизнь со службой в Вооруженных силах России. Обучение производится по ракетно-артиллерийским специальностям в интересах Военно-Морского Флота и Управления военных представительств МО РФ."
        val urlImageSPO: String = "https://www.voenmeh.ru/images/news/2024/02/spo_3.jpg"
        val specializationSPO: List<String> = listOf(
            "Информационные системы и программирование",
            "Разработка электронных устройств и систем",
            "Аддитивные технологии",
            "Технология машиностроения",
            "Управление качеством продукции, процессов и услуг (по отраслям)",
        )
        val linkSPO: String = "https://www.voenmeh.ru/education/faculties-and-departments/fac-spo"

        val titleError: String = "Ой, кажется что-то пошло не так!"
        val unexpectedMessage: String = "Произошла непредвиденная ошибка. Пожалуйста, перезапустите приложение или обратитесь к специалисту."

        object Achievement {
            val lockedTitle: String = "Карточка заблокирована!"
            val lockedDescription: String = "Для того чтобы разблокировать карточку, необходимо найти QR-код, отсканировать его и выполнить небольшое задание."
        }

        object Common {
            val ok = "Ок"
            val close: String = "Закрыть"
        }
    }

    object Region {
        val RU: String = "+7"
    }

}